Autodesk.Navisworks.Api.SimulationType
Type of simulation being run.

Autodesk.Navisworks.Api.SimulationType.None
No simulation

Autodesk.Navisworks.Api.SimulationType.Timeliner
Timeliner simulation

Autodesk.Navisworks.Api.SimulationType.Animator
Animator simulation